In [1]:
import pandas as pd
import numpy as np
from load_data import load_data

In [2]:
df = load_data()

In [3]:
df.head()

,order_id,customer_id,product_category,product_name,quantity,unit_price,order_date,customer_age,customer_region,shipping_cost,discount_applied,total_amount,discounted_amount,final_amount,order_month,order_quarter
0,ORD0001,CUST103,Sports,Product_25,1,124.30,25/07/2023,24,West,10.14,10,124.30,111.870,122.010,7,3
1,ORD0002,CUST180,Electronics,Product_36,1,66.35,10/11/2023,44,West,19.39,0,66.35,66.350,85.740,11,4
2,ORD0003,CUST093,Books,Product_75,5,145.74,04/04/2023,18,West,5.56,5,728.70,692.265,697.825,4,2
3,ORD0004,CUST015,Clothing,Product_51,4,154.21,07/05/2023,44,East,12.51,0,616.84,616.840,629.350,5,2
4,ORD0005,CUST107,Sports,Product_15,3,29.48,25/01/2023,33,North,17.54,10,88.44,79.596,97.136,1,1

In [4]:
df.shape

(1000, 16)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 0 to 999
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           1000 non-null   object
 1   customer_id        1000 non-null   object
 2   product_category   1000 non-null   object
 3   product_name       1000 non-null   object
 4   quantity           1000 non-null   int64
 5   unit_price         1000 non-null   float64
 6   order_date         1000 non-null   object
 7   customer_age       1000 non-null   int64
 8   customer_region    1000 non-null   object
 9   shipping_cost      1000 non-null   float64
 10  discount_applied   1000 non-null   int64
 11  total_amount       1000 non-null   float64
 12  discounted_amount  1000 non-null   float64
 13  final_amount       1000 non-null   float64
 14  order_month        1000 non-null   int64
 15  order_quarter      1000 non-null   int64
dtypes: float64(5), int64(5), object(6)
memory usage: 132.8+ KB